// https://youtu.be/OZkaGAcphIg

// // область видимості 14:12

// const x = {};
// // --------
// const fn = function (myObject) {
//   console.log(myObject);
// };

// fn({ a: 1, b: 2 });
// // --------
// const rtfm = function () {
//   return { a: 5 };
// };
// console.log(rtfm);

// ---------------------------------------------------------
// 15: 30 - доступ console.log(playlist.rating);
// 17:30  - console.log(playlist['rating']);
// 26:00 - ,
// 29:00 - []:

// ====================================================
// 45:30 методи
// ====================================================
// 01:02:00 for...in Object.keys 
///// Namber Boolean Array Object
// 01:08:00 for...in Object.values

// ====================================================
// 01:13:00 робота з колекцією (масивом обєктів)
// ====================================================
// 1:35:00 true items
