// https://www.youtube.com/watch?v=Hl4_H5wObM4&ab_channel=GoITFrontend
заняття 8  частина 1
// =====================================================
// Модуль 6. Занятие 11. Перебирающие методы массивов часть 1(27.08)
// 0:10 перебирающие методы массива
// 1:40 метод for each
// 5:50 map (возвращает массив такой же длинны)
// 18:00 пример использование map для изменения элементов на всем объекте (распыление, подменяем свойство)
// 23:00 замена одного элемента через map
// 35:00 filter
// 50:10 find
// 58:00 every
// 1:00:55 some
// 1:03:50 reduce
// 1:24:50 собираем все теги из твитов через reduce аккумулятор - массив)
// 1:36:10 ведем статистику тегов
// =====================================================
