// https://www.youtube.com/watch?v=Hl4_H5wObM4&ab_channel=GoITFrontend
// заняття 8  частина 1
// =====================================================
// Модуль 6. Занятие 11. Перебирающие методы массивов часть 1(27.08)
// 0:10 перебирающие методы массива
// 1:40 метод for each
// 5:50 map (возвращает массив такой же длинны)
// 18:00 пример использование map для изменения элементов на всем объекте (распыление, подменяем свойство)
// 23:00 замена одного элемента через map
// 35:00 filter
// 50:10 find
// 58:00 every
// 1:00:55 some
// 1:03:50 reduce
// 1:24:50 собираем все теги из твитов через reduce аккумулятор - массив)
// 1:36:10 ведем статистику тегов
// =====================================================


// https://www.youtube.com/watch?v=kB6lTfrvlRg&ab_channel=GoITFrontend
// заняття 8  частина 2
// Модуль 6. Занятие 12. Перебирающие методы массивов часть 2(31.08)


// 0:10 метод sort
// 8:30 sort.изменяет оригинальный массив. Как сделать копию
// 15:50 сортировка сложных типов
// 33:00 flat (разглаживает массивы с вложенностями - массивы в массивах)
// 35:30 flatMap
// 39:00 chaining
// 50:00 chaining в методах объекта как jquery
// 53:30 flat+reduce
// 55:40 lodash
// 1:01:00 isEmpty
// 1:04:00 get
// 1:13:00 union
// 1:14:50 range
// 1:17:00 sortBy
// 1:20:00 sum, sumBy
// 1:22:00 uniq, uniqBy
// 1:22:20 sortedUniq, sortedUniqBy
// 1:22:40 min, max, minBy, maxBy
// 1:24:00 camelCse, capitalize, kebabCase, lowerCase, upperCase